// Модуль, содержащий функции для предоставления начальных данных для сцены, 
// таких как начальная позиция камеры и графические объекты.

use bevy::prelude::*;

use crate::graphic_object::GraphicObject;

/// Начальная позиция камеры
pub fn initial_camera_position() -> Vec3 {
    Vec3::new(10.0, 15.0, 17.5)
}

/// Создает вектор графических объектов для сцены. Каждый объект имеет позицию, угол поворота и цвет.
pub fn scene_objects() -> Vec<GraphicObject> {
    vec![
        // Красный — справа (+X), угол 180°.
        GraphicObject::new(Vec3::new(4.0, 0.0, 0.0), 180.0, Vec3::new(1.0, 0.0, 1.0)),
        // Синий — слева (-X), угол 0°.
        GraphicObject::new(Vec3::new(-4.0, 0.0, 0.0), 0.0, Vec3::new(0.0, 0.0, 1.0)),
        // Зелёный — сзади (-Z), угол 90°.
        GraphicObject::new(Vec3::new(0.0, 0.0, -4.0), 90.0, Vec3::new(0.0, 1.0, 0.0)),
        // Белый — спереди (+Z), угол 270°.
        GraphicObject::new(Vec3::new(0.0, 0.0, 4.0), 270.0, Vec3::new(1.0, 1.0, 0.0)),
    ]
}
